<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2">
<meta name="theme-color" content="#222">
<meta name="generator" content="Hexo 4.2.1">
  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png">
  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png">
  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png">
  <link rel="mask-icon" href="/images/logo.svg" color="#222">

<link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/lib/font-awesome/css/all.min.css">

<script id="hexo-configurations">
    var NexT = window.NexT || {};

<figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">// 5.</span></span><br><span class="line"><span class="function"><span class="keyword">void</span> <span class="title">te01</span><span class="params">()</span></span></span><br><span class="line"><span class="function"></span>&#123;</span><br><span class="line">	<span class="comment">//父类指针指向了一个开辟了一个在堆区的子类数据</span></span><br><span class="line"></span><br><span class="line">	animal* a = <span class="keyword">new</span> cat(<span class="string">"Tom"</span>);</span><br><span class="line">    </span><br><span class="line">	<span class="comment">//new一个在堆区的cat类型的对象，cat继承自animal</span></span><br><span class="line">	<span class="comment">//我们知道创建子类时会先创建父类</span></span><br><span class="line">    </span><br><span class="line">	<span class="comment">//所以先调用了animal的构造函数</span></span><br><span class="line">	<span class="comment">//再是cat的构造函数</span></span><br><span class="line">   </span><br><span class="line">    </span><br><span class="line">	<span class="comment">//亿点细节：</span></span><br><span class="line">    </span><br><span class="line">		<span class="comment">//在创建父类时，如果发现父类中有虚函数</span></span><br><span class="line">		<span class="comment">//编译器就会使用一个叫虚函数表的东西，保存所有的虚函数，包括纯虚函数</span></span><br><span class="line">		<span class="comment">//在这里,animal父类的虚函数表中，有两个虚函数</span></span><br><span class="line">    </span><br><span class="line">		<span class="comment">/*</span></span><br><span class="line"><span class="comment">			class animal	size(4):</span></span><br><span class="line"><span class="comment">					+---</span></span><br><span class="line"><span class="comment">			0		| (vfptr)</span></span><br><span class="line"><span class="comment">					+---</span></span><br><span class="line"><span class="comment">					</span></span><br><span class="line"><span class="comment">			animal::$vftable@:</span></span><br><span class="line"><span class="comment">					| &amp;animal_mata</span></span><br><span class="line"><span class="comment">					|  0</span></span><br><span class="line"><span class="comment">			0		| &amp;animal::(dtor) </span></span><br><span class="line"><span class="comment">			1		| &amp;animal::speak</span></span><br><span class="line"><span class="comment">		*/</span></span><br><span class="line">    </span><br><span class="line">		<span class="comment">//&amp;animal::(dtor)  就是animal的纯虚构函数的地址</span></span><br><span class="line">		<span class="comment">//dtor是destructor的缩写，是析构函数的意思，中文直译叫"垃圾焚毁炉"</span></span><br><span class="line">		<span class="comment">//&amp;animal::speak   就是speak虚函数的地址</span></span><br><span class="line">    </span><br><span class="line">		<span class="comment">//接着，子类继承了这个表，重写了speak。</span></span><br><span class="line"></span><br><span class="line">		<span class="comment">/*</span></span><br><span class="line"><span class="comment">			class cat       size(8):</span></span><br><span class="line"><span class="comment">			        	+---</span></span><br><span class="line"><span class="comment">			 0      	| +--- (base class animal)</span></span><br><span class="line"><span class="comment">			 0      	| | &#123;vfptr&#125;</span></span><br><span class="line"><span class="comment">			        	| +---</span></span><br><span class="line"><span class="comment">			 4      	| m_Name</span></span><br><span class="line"><span class="comment">			        	+---</span></span><br><span class="line"><span class="comment">			        </span></span><br><span class="line"><span class="comment">			cat::$vftable@:</span></span><br><span class="line"><span class="comment">					| &amp;cat_meta</span></span><br><span class="line"><span class="comment">					|  0</span></span><br><span class="line"><span class="comment">					| &amp;cat::(dtor)</span></span><br><span class="line"><span class="comment">			 0		| &amp;cat::speak</span></span><br><span class="line"><